scripts/obploadtest.yml
config:
  target: 'https://experimental-api.openbankproject.com'
  phases:
    -
      duration: 180
      arrivalRate: 10
    -
      duration: 180
      arrivalRate: 50
    -
      duration: 1500
      arrivalRate: 50
  defaults:
    headers:
      Authorization: 'DirectLogin token="eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyIiOiIifQ.RHvF5s8c_LJ-b1u6Zs7kjKmBa4jbcS7qj7KEneJzZyw"'

scenarios:
  - flow:
    - get:
        url: "/obp/v2.1.0/my/banks/obp.01.us.us/accounts/de60be99-c6bb-4239-a585-5d81643ada05/transactions"